[
  {
    "id": "1",
    "title": "CREATIVE LEAD",
    "description": "Groovrick is seeking a Creative Lead to spearhead creative initiatives across all aspects of the brand, from storytelling, customer experience, and partnerships. This hire will bring management skills and can communicate visually the Groovrick brand and lifestyle across multiple touch points. The ideal candidate will have prior experience as a creative lead working with design, art direction and brand initiatives, as well as have a network of relationships within the creative community locally and can set the creative tone for every assigned project. Our assignments include social media content development, illustration development, film and video production, marketing campaigns, influence marketing and beyond.",
    "responsibilities": [
      "Lead the creative team and provide strategic vision",
      "Champion the brand internally and externally",
      "Oversee and develop the visual aesthetic of Groovrick and all of its assets",
      "Maintain consistency of Groovrick’s brand identity: includes look and feel for all consumer-facing creative implemented online and across social media platforms",
      "Develop creative strategy presentations that show the development of digital concepts and usability",
      "Manage and mentor a team of digital designers and videographers, clearly communicating vision, ensuring effectiveness of team output and adherence to project demands",
      "Partner with the marketing and technical team leaders to develop creative campaigns and align activities with the brand essence",
      "Good understanding of social, online culture and trends",
      "Effectively implement changes for clients and agency in a way that demonstrates powerful and unique thinking",
      "Ensure work and relationships are founded on open and honest communications; listen and ask the right questions during day-to-day work",
      "Ensure that client counsel and agency action is purposeful and challenging while prioritizing the interests of the wider agency",
      "Ability to work closely with our team of account managers to build and maintain strong client relationships",
      "Develop and curate creative concepts during initial phases of creative development",
      "Execute top-quality work as necessary in alignment with the agency’s standards"
    ],
    "requirements": [
      "Minimum 2 years of experience as a Creative Lead",
      "Knowledge of photography, photography principles and experience working on-set providing art/creative direction",
      "Ability to manage budgets, allocates resources, and meet deadlines",
      "Expert knowledge of Adobe Creative Suite",
      "Advanced proficiency in Adobe Photoshop, Illustrator, InDesign, After Effects",
      "Knowledge and maintained interest in design, videography and photography"
    ],
    "note": "Experience in a creative agency would be preferred"
  },
  {
    "id": "2",
    "title": "MARKETING PR",
    "description": "Groovrick is seeking a Marketing and PR Lead to spearhead their marketing strategies for the services it offers. This hire will bring marketing skills to enroll new clients into their social media storytelling, creative development and influencer marketing plans. The ideal candidate will be communicating visually the Groovrick brand and its services to potential clients.",
    "responsibilities": [
      "Researching potential clients, seeking brand managers in relevant targeted industries.",
      "Connecting and meeting up with brand managers to pitch Groovrick’s services.",
      "Promote and elevate the visibility of the Groovrick.",
      "Makes necessary phone calls and meetings to help sales. Allows people to make inquiries as necessary.",
      "Create, execute, and manage comprehensive communications strategies to effectively inform, engage, and motivate target potential clients.",
      "Serve as primary PR and media communications contact.",
      "Stay up to date on industry trends and research."
    ],
    "requirements": [
      "Bachelor’s in marketing/Business Administration from a renowned institution.",
      "Atleast 1 year professional marketing experience, B2B experience a plus.",
      "Experience designing and implementing integrated marketing programs to generate & build awareness, positive brand sentiment, as well as demand generation.",
      "Pro-active, self-starter, and comfortable operating in a fast-paced environment across multiple functions.",
      "Highly efficient, with a strong attention to detail."
    ],
    "note": "Experience in a creative agency would be preferred"
  },
  {
    "id": "3",
    "title": "INTERN",
    "description": "",
    "positions": [
      "Visual Communication",
      "Video Editing & VFX",
      "Digital Marketing",
      "Data Analytics",
      "Motion Graphics",
      "Graphic Design",
      "UI/UX Design",
      "Full Stack Dev",
      "AR/VR, AI, ML",
      "Research"
    ],
    "note": ""
  }
]
